#__________________________________________________________________________
# 모듈 로딩
import pandas as pd

#__________________________________________________________________________
# D1020_WORK_김현우
#__________________________________________________________________________
# 문제 1 아래 데이터를 시리즈 객체로 저장해 주세요. 
#     => 1차원 데이터 저장하는 판다스 자료형
#     => 구성 : 인덱스 + 데이터
# -------- 
# 점수
# 100
# 200
# 300
# -------- 
#__________________________________________________________________________
data = [100, 200, 300]

data01 = pd.Series(data, name = "점수")
print("문제 1----------------------------------------")
print(data01)
print(f"인덱스: {data01.index}")
print(f"이  름: {data01.name}")
print(f"형  태: {data01.shape}")
print(f"차  원: {data01.ndim}")
print(f"메모리: {data01.values}")
print(f"타  입: {data01.dtype}\n")

#__________________________________________________________________________
# 문제 2. 아래 데이터를 시리즈 객체로 저장해 주세요. 
# ---------------------------- 
# 인덱스 점수
# 철수 100
# 영희 200
# 아름 300
# ---------------------------- 
#__________________________________________________________________________


data02 = pd.Series([100, 200, 300], 
                   ["철수", "영희", "아름"],
                   name = '점수',
                   dtype = 'int')
print("문제 2----------------------------------------")
print(f"{data02}\n")
#__________________________________________________________________________
# 문제 3. 아래 데이터를 시리즈 객체로 저장해 주세요. 저장 후 인덱스 속성과 형태 속성을 출력해 주세요. 
# ---------------------------- 
# 종목명 종가
# 삼성전자 73000
# 셀트리온 356000
# 카카오 367000
# 삼성전자우 68600
# 현대바이오 34150
# ---------------------------- 
#__________________________________________________________________________
data = [73000, 356000, 367000, 68600, 34150]
index = ["삼성전자", "셀트리온", "카카오", "삼성전자우", "현대바이오"]

data03 = pd.Series(data, 
                   index,
                   name = "종가"
                   )
print("문제 3----------------------------------------")

print(data03)

print(f"인덱스 속성: {data03.index}")
print(f"형태 속성: {data03.shape}\n")
#__________________________________________________________________________
# 문제 4. 아래 파일을 읽어서 DataFrame으로 저장하는 함수를 적어주세요. 
# ----------------------------
# -> data.xlsx :
# -> data.csv :
# -> data.json : 
# ----------------------------
#__________________________________________________________________________
def read_excel(file_path):
    return pd.read_excel(file_path)

def read_csv(file_path):
    return pd.read_csv(file_path)
    
def read_json(file_path):
    return pd.read_json(file_path)

# read_excel("../Data/data.xlsx")
# read_csv("../Data/data.csv")
# read_json("../Data/data.json")
#__________________________________________________________________________
# 문제 5. 아래 데이터를 DataFrame으로 저장해 주세요.
# --------------------------- 
# 이름 나이 직책
# 김은수 35 과장
# 박정민 30 대리
# 이하나 28 대리
# ---------------------------
#__________________________________________________________________________
# [5-1] List 타입의 데이터 저장_____________________________
data_list = [['김은수', 35, '과장'],
             ['박정민', 30, '대리'],
             ['이하나', 28, '대리']]

columns = ['이름', '나이', '직책']

data05_1 = pd.DataFrame(data_list, columns = columns)

print("문제 5----------------------------------------")

print(f"{data05_1}\n")

print(f"인덱스: {data05_1.index}")
print(f"컬럼즈: {data05_1.columns}")    # 컬럼 식별용
print(f"형  태: {data05_1.shape}")
print(f"차  원: {data05_1.ndim}")
print(f"메모리: {data05_1.values}")
print(f"타  입: {data05_1.dtypes}\n")   # 컬럼 단위 타입

# [5-2] Dict 타입의 데이터 저장_____________________________
#       Key => Column Name으로 설정

data_dict = {  # 딕셔너리 -> 열 단위
    "이름": ["김은수", "박정민", "이하나"],
    "나이": [35, 30, 28],
    "직책": ["과장", "대리", "대리"]
}
data05_2 = pd.DataFrame(data_dict)  

print(f"{data05_2}\n")
#__________________________________________________________________________
# 문제 6. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요. 
data = [["2차전지(생산)", "SK이노베이션", 10.19, 1.29], 
        ["해운", "팬오션", 21.23, 0.95], 
        ["시스템반도체", "티엘아이", 35.97, 1.12], 
        ["해운", "HMM", 21.52, 3.20], 
        ["시스템반도체", "아이에이", 37.32, 3.55], 
        ["2차전지(생산)", "LG화학", 83.06, 3.75]]

columns = ["테마", "종목명", "PER", "PBR"]

print("문제 6----------------------------------------")
# (6-1) DataFrame으로 저장해 주세요.
data06 = pd.DataFrame(data, columns=columns)

# (6-2) 행인덱스를 SK, PO, TL, HMM, IA, LG로 설정해서 저장해 주세요.
index_ = ['SK', 'PO', 'TL', 'HMM', 'IA', 'LG']
data06 = pd.DataFrame(data, 
                      columns=columns,
                      index = index_)

# (6-3) 데이터 전체를 출력하세요.
print(f"{data06}\n")

# (6-4) 행 인덱스 속성만 출력하세요.
print(f"{data06.index}\n")

# (6-5) 형태 및 차원 정보 출력하세요.
print(f"data06 형태: {data06.shape}, data06 차원: {data06.ndim}\n")

# (6-6) 컬럼 속성만 출력하세요.
print(f"{data06.columns}\n")

# (6-7) 실제 메모리에 저장된 데이터만 출력해 주세요.
print(f"{data06.values}\n")
