#__________________________________________________________________________
# 개발자/사용자 정의 모듈 및 패키지 사용하기

# - 모듈 : 파이썬 파일(.py) 1개
# - 패키지: 모듈 여러 개 묶은 것
#__________________________________________________________________________
# 모듈 로딩
# - D1002
#   |--- ex_custom.py *
#   |--- utills.py
#   |--- func
#         |--- my_func.py
# - COMM
#    |---display.py
#__________________________________________________________________________
import utills   # 같은 위치 즉, 폴더에 존재하는 모듈
import func.my_func as mf

import sys
sys.path.append(r'C:\Users\khw27\바탕 화면\SL_KDT_10\01_PYTHON\COMM')
import display
#__________________________________________________________________________
# 모듈 사용
#__________________________________________________________________________
utills.print_msg("Good Luck 2025")
r1, r2, r3, r4 = mf.calc(3, 4)

print(f"+ -> {r1}")
print(f"- -> {r2}")
print(f"* -> {r3}")
print(f"/ -> {r4}")

display.show()
