#__________________________________________________________________________
# 모듈 로딩
#__________________________________________________________________________
import random
#__________________________________________________________________________
# [1] 모듈 기본 활용
#__________________________________________________________________________
# -> 0 이상 1 미만의 실수값 난수 추출
print(random.random())

# -> 0 이상 10 이하의 정수값 난수 추출
print(random.randint(1, 10))

# -> 0 이상 100 미만의 실수 난수 추출
print(random.uniform(0, 100))
#__________________________________________________________________________
# [2] 복원 & 비복원 난수 추출 및 무작위 섞기
#__________________________________________________________________________
fruits = ["apple", "banana", "cherry", "mango"]

# -> 무작위로 하나 선택 : 복원
print(random.choice(fruits))

# -> 무작위로 3개 선택 (중복 가능)
print(random.choices(fruits, k = 3))

# -> 무작위로 2개 선택 (중복 없음)
print(random.sample(fruits, 2))

# -> 리스트 무작위 섞기 : 원본 데이터 자체에 변경
random.shuffle(fruits)
print(fruits)
#__________________________________________________________________________
# [3] 재현성 유지 설정 및 난수 추출
#__________________________________________________________________________
# -> 매번 다른 난수 추출
for _ in range(5):
    print(random.randint(1, 100), end = ' ')

# 재현성 유지 설정
random.seed(42)
print("\n난수 추출 고정+++++")

# -> 매번 동일한 난수 추출
for _ in range(5):
    print(random.randint(1, 100), end = ' ')