// -----------------------------------------------------
// 시작화면
// 1. 게임 시작 - 표 띄우기
// 2. 게임 종료 - 종료
// -----------------------------------------------------
// 사과게임을 시작하겠습니다.
// 시작 행열과 종료 행열을 지정해주세요.
// 범위 안의 요소들의 값이 10이면 값들이 사라집니다.
// -----------------------------------------------------
// 1.	사과게임의 크기를 설정해야 됨. 이건 변하면 안됨.
// 2.	랜덤 숫자를 2차원 배열에 넣어야 된다. 단, 10 미만이어야 됨.
// 3.	시작 행열부터 범위를 지정해서 종료 행열까지 요소들의 총합을 구해야 함. -> 초기화 필수
// 4.	만약에 총합의 크기가 10이다 -> 그러면 해당 위치들의 요소들 값 모두를 '-'로 초기화
// 4-1. 만약에 10이 아니다 -> 변경X, 
// 5.	단, '-'가 포함된 행열을 선택할 시 예외처리가 필요함 -> 이미 삭제된 요소입니다.
// 6.   SCORE 설정 -> 삭제한 요소 당 1점 -> CMD에 계속 업데이트 되게 표시
// 7.   계속 printf 하는 함수 필요
// 8.   제한 시간이 끝나면 종료
// -----------------------------------------------------
// 총 크기는 10 * 10
// -----------------------------------------------------
