#__________________________________________________________________________
# Python GUI Programming - TKinter
# **Entry Widget: 사용자의 텍스트 기반 요청을 전달받는 입력 UI요소
#__________________________________________________________________________
# 모듈 로딩
#__________________________________________________________________________
from tkinter import *
#__________________________________________________________________________
# 윈도우 관련
#__________________________________________________________________________
# 윈도우 창 인스턴스 생성
mainWin = Tk()

# 윈도우 창에 설정
mainWin.title("현우")
 # (width, height, x, y) -> width/height: 창 크기, x/y: 창 위치
mainWin.geometry("300x400+500+200") 
# 창 크기 조절 가능 유무 (width, height)
mainWin.resizable(True, True)  
#__________________________________________________________________________
# 윈도우에 배치될 UI 요소들 - Entry Label 요소
#__________________________________________________________________________
# 인스턴스 생성
inputFD = Entry(mainWin,
                show = "Enter message:",
                foreground="blue")    

# UI 인스턴스 윈도우에 배치
inputFD.pack()
#__________________________________________________________________________
# 윈도우에서 발생하는 사용자 이벤트 수신
#__________________________________________________________________________
# 종료 전까지 동작
mainWin.mainloop()
