#__________________________________________________________________________
# Python GUI Programming - TKinter
# **Label Widget: 텍스트, 이미지 출력 UI요소
#__________________________________________________________________________
# 모듈 로딩
#__________________________________________________________________________
from tkinter import *
#__________________________________________________________________________
# 윈도우 관련
#__________________________________________________________________________
# 윈도우 창 인스턴스 생성
mainWin = Tk()

# 윈도우 창에 설정
mainWin.title("현우")
 # (width, height, x, y) -> width/height: 창 크기, x/y: 창 위치
mainWin.geometry("400x500+100+100") 
# 창 크기 조절 가능 유무 (width, height)
mainWin.resizable(True, True)  
#__________________________________________________________________________
# 윈도우에 배치될 UI 요소들 - Text Label 요소
#__________________________________________________________________________
# 인스턴스 생성
msgLB1 = Label(text="msg_left", 
              background='yellow',
              foreground='red',
              width=30)

msgLB2 = Label(text="TEST", 
              background='yellow',
              foreground='red',
              width=30)

# UI 인스턴스 윈도우에 배치
msgLB1.pack(side = "left")
msgLB2.pack(side = "top")

#__________________________________________________________________________
# 윈도우에서 발생하는 사용자 이벤트 수신
#__________________________________________________________________________
# 종료 전까지 동작
mainWin.mainloop()
