/* ********************************************************
* File name   : ex01_func.c
* Description : 사용자 정의 함수 - return
* Author      : HyeonWoo
* History     : 2025.01.02 HyeonWoo
* **********************************************************/
#include <stdio.h>

// ------------------------------------------------------
// 함수이름: add
// 함수기능: 2개 정수 덧셈 후 반환
// 매개변수: int x, int y
// 반 환 값: int
// ------------------------------------------------------
int add(int x, int y) {
    return x + y;
}

// ------------------------------------------------------
// 함수이름: sub
// 함수기능: 2개 정수 뺄셈 후 반환
// 매개변수: int x, int y
// 반 환 값: int
// ------------------------------------------------------
int sub(int x, int y) {
    return x - y;
}

// ------------------------------------------------------
// 정의부
// ------------------------------------------------------
int add(int x, int y);
int sub(int x, int y);

// ------------------------------------------------------
// main
// ------------------------------------------------------
int main(void) {
    int result_add, result_sub;

    // 함수 호출 및 결과 확인
    result_add = add(10, 7);
    result_sub = sub(10, 7);

    printf("add(10, 7) 결과: %d\n", result_add);
    printf("sub(10, 7) 결과: %d\n", result_sub);

    return 0;
}
