/* ********************************************************
* File name   : ex02_func.c
* Description : 사용자 정의 함수 - void
* Author      : HyeonWoo
* History     : 2025.01.02 HyeonWoo
* **********************************************************/
#include <stdio.h>

// ------------------------------------------------------
// 함수이름: add
// 함수기능: 2개 정수 덧셈 후 print
// 매개변수: int x, int y
// 반 환 값: 없음
// ------------------------------------------------------
void add(int x, int y) {
    printf("덧셈 결과 : %d\n", x + y);
}

// ------------------------------------------------------
// 함수이름: sub
// 함수기능: 2개 정수 뺄셈 후 print
// 매개변수: int x, int y
// 반 환 값: 없음
// ------------------------------------------------------
void sub(int x, int y) {
    printf("뺄셈 결과 : %d\n", x - y);
}

// ------------------------------------------------------
// 함수이름: multi
// 함수기능: 2개 정수 곱셈 후 print
// 매개변수: int x, int y
// 반 환 값: 없음
// ------------------------------------------------------
void multi(int x, int y) {
    printf("곱셈 결과 : %d\n", x * y);
}

// ------------------------------------------------------
// 정의부
// ------------------------------------------------------
void add(int x, int y);
void sub(int x, int y);
void multi(int x, int y);

// ------------------------------------------------------
// main
// ------------------------------------------------------
int main(void) {
    int result_add, result_sub;

    // 함수 호출 및 결과 확인
    add(10, 7);
    sub(10, 7);
    multi(10, 7);

    return 0;
}
