/* ********************************************************
* File name   : ex04_array.c
* Description : 배열 초기화
* Author      : HyeonWoo
* History     : 2025.01.02 HyeonWoo
* **********************************************************/
// ----------------------------------------------------------
// 배열 초기화 방법들 
// ----------------------------------------------------------

#include <stdio.h>

int main(void)
{
	int score[5];

	for (int i = 0; i <= 4; i++) {
		score[i] = (i+1) * 10;
	}

	for (int i = 0; i <= 4; i++) {
		printf("score[%d] = %d\n", i, score[i]);
	}

	// 선언과 초기화 함께 진행
	int age[10] = { 5, 19, 20, 39, 40, 30, 58, 39, 40, 29 };
	int nums1[] = { 100, 200, 300 };
	int nums2[10] = { 100, 200 };
	int nums3[10] = { 0 };
	int nums4[01];

	for (int i = 0; i < 10; i++) {
		printf("age[%d] = %d\n", i, age[i]);
	}
	return 0;
}