/* ********************************************************
* File name   : ex05_array.c
* Description : 배열
* Author      : HyeonWoo
* History     : 2025.01.02 HyeonWoo
* **********************************************************/
// ----------------------------------------------------------
// 배열의 요소 개수 계산
// ----------------------------------------------------------

#include <stdio.h>

int main(void)
{
	// 문자 10개 입력
	char ch[10];

	// 입력 받아서 저장
	printf("문자 10개로 구성된 문자열 입력 : ");	// null 문자(/n) 포함해서 10개
	scanf("%9s", ch);	// 길이제한(10개)
						// 입력받은 문자열에 널문자/종료문자를 추가해서 저장

	printf("array ch : %s\n", ch);

	return 0;
}