#__________________________________________________________________________
# [복습 - 클래스와 객체 활용]
# - 학생, 의사 클래스 정의
# - 객체 연산 가능하도록 구현 => 연산자는 마음대로 
#__________________________________________________________________________
# [클래스 1]
# 클래스 이름: Student
# 클래스 기능: 학생 정보 출력
# 속      성: 인스턴스 속성 -> 이름, 성별, 성적
#            클래스 속성 -> X
# 메  서  드: 학생 정보 출력
# 연산자오버로딩: 덧셈 => 정수 덧셈 후 반환
#               연산자와 __OOO__(self, other) 맵핑
#__________________________________________________________________________
class Student:

    # 속성 초기화
    def __init__(self, name, gender, grade):
        self.name = name
        self.gender = gender
        self.grade = grade
    
    def printInfo(self):
        print(f"{'학생 정보':=^10} ")
        print(f"이름: {self.name}")
        print(f"성별: {self.gender}")
        print(f"성적: {self.grade}")
    #______________________________________________________________________
    # 연산자 오버로딩 메서드
    #______________________________________________________________________
    # 함수이름: __add__
    # 함수기능: 인스턴스의 grade 덧셈 후 반환
    # 매개변수: self    - 인스턴스/객체
    #          other   - 인스턴스/객체
    # 반환결과: 덧셈 결과값
    #______________________________________________________________________
    def __add__(self, other):
        return self.grade + other.grade
    #______________________________________________________________________
#__________________________________________________________________________
# 객체/인스턴스 생성 및 실행
#__________________________________________________________________________
st = Student("홍길동", "남자", "A+")
st.printInfo()

print()
#__________________________________________________________________________
# [클래스 2]
# 클래스 이름: Doctor
# 클래스 기능: 선택한 진료과목 출력, 잔돈 계산
# 속      성: 인스턴스 속성 -> 선택한 진료과목, 낸 돈
#            클래스 속성 -> 진료과목, 진료비
# 메  서  드: 학생 정보 출력
#__________________________________________________________________________
class Doctor:

    tm1 = "피부과"
    tm2 = "정형외과"
    tm3 = "이비인후과"
    money = 5000

    def printInfo(self, select):

        self.select = select
        
        if(self.select == Doctor.tm1):
            print("선택하신 진료과목은 피부과입니다.")

        elif(self.select == Doctor.tm2):
            print("선택하신 진료과목은 정형외과입니다.")

        elif(self.select == Doctor.tm3):
            print("선택하신 진료과목은 이비인후과입니다.")

    def check(self, pay):
        
        self.pay = pay

        if(Doctor.money > self.pay):
            print("돈이 부족합니다.")
        else:
            print(f"거스름돈은 {pay - Doctor.money}원 입니다.")
#__________________________________________________________________________
# 객체/인스턴스 생성 및 실행
#__________________________________________________________________________
tm = input("원하시는 진료과목을 입력하시오(피부과/정형외과/이비인후과): ").strip()
if tm in ["피부과", "정형외과", "이비인후과"]:

    dt = Doctor()
    dt.printInfo(tm)

else:
    print("예시 중 하나를 입력하시오.")

try:
    pay = int(input("지출하실 돈을 입력하시오(진료비 5000원): ").strip())
    dt.check(pay)

except ValueError:
    print("숫자로 입력해주세요.")
#__________________________________________________________________________
# [클래스 3]
# 클래스 이름: Doctor2
# 클래스 기능: 내과 의사 데이터 표현
# 속      성: 
#            클래스 속성 -> 분야
#            인스턴스 속성 -> 병원이름, 의사이름, 의사경력
#            비공개 속성 -> 의사면허번호
# 메  서  드: 진료한다, 의사정보출력, 의사면허번호 알려주기
#            비공개 속성 접근 메서드: getter/setter => get_id()
#__________________________________________________________________________
class Doctor2:
    # 클래스 속성
    KIND = '내과'
    #======================================================================
    # 인스턴스/객체 속성 초기화 메서드(생성자 메서드)
    #======================================================================
    def __init__(self, hname_, dname_, dyear_, id_):
        self.hname = hname_
        self.dname = dname_
        self.dyear = dyear_
    #======================================================================
    # 비공개용 속성
        self.__id = id_
    #_____________________________________________________________________
    # 인스턴스/객체 전용 메서드
    #______________________________________________________________________
    # 함수이름: care
    # 함수기능: 진료한다
    # 매개변수: self - 인자 전달X, 파이썬에서 처리
    # 반환결과: 출력하므로 없음
    #______________________________________________________________________
    def care(self):
        print(f"{self.dname}의사 선생님이 진료한다.")
    #______________________________________________________________________
    # 함수이름: printInfo
    # 함수기능: 의사정보 출력
    # 매개변수: self - 인자 전달X, 파이썬에서 처리
    # 반환결과: 출력하므로 없음
    #______________________________________________________________________
    def printInfo(self):
        print(f"{'의사 정보':=^15}")
        print(f"이   름: {self.dname}")
        print(f"경   력: {self.dyear}")
        print(f"면   허: {self.__id}")
    #======================================================================
    # 비공개 속성 접근 getter/setter 메서드
    #======================================================================
    # 함수이름: getId
    # 함수기능: 의사면허번호 반환
    # 매개변수: self - 인자 전달X, 파이썬에서 처리
    # 반환결과: 의사면허번호
    #======================================================================
    def getId(self):
        return self.__id
    #======================================================================


