// =========================================================================
//                      코드형 - POINTER (초급)
// =========================================================================
#include <stdio.h>
// -------------------------------------------------------------------------
// 01. int형 변수 1개를 선언하고,
//    해당 변수의 값과 주소를 포인터를 사용해 출력하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	int a = 10;
//	int* ptr = &a;
//
//	printf("a의 값 : %d, a의 주소 : %p", *ptr, ptr);
//
//	return 0;
//}

// -------------------------------------------------------------------------
// 02. int형 변수 1개와 int 포인터 1개를 선언한 뒤,
//    포인터를 통해 변수 값을 100으로 변경하고 출력하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	int a = 10;
//	int* ptr = &a;
//
//	*ptr = 100;
//
//	printf("a의 값 : %d, a의 주소 : %p", *ptr, ptr);
//
//	return 0;
//}

// -------------------------------------------------------------------------
// 03. 포인터 변수를 사용하여
//    int형 변수의 값을 2배로 만드는 코드를 작성하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	int a = 10;
//	int* ptr = &a;
//
//	*ptr *= 2;
//
//	printf("a의 값 : %d, a의 주소 : %p", *ptr, ptr);
//
//	return 0;
//}

// -------------------------------------------------------------------------
// 04. char형 변수에 문자 하나를 저장하고,
//    포인터를 사용해 해당 문자를 출력하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	char chr = 'A';
//	char* ptr = &chr;
//
//	printf("chr의 값 : %c, chr의 주소 : %p", *ptr, &ptr);
//}

// -------------------------------------------------------------------------
// 05. int형 배열(크기 5)을 선언하고,
//     포인터를 사용해 모든 원소를 출력하세요. ([] 사용 금지)
// -------------------------------------------------------------------------
//int main(void)
//{
//	int arr[5] = { 10, 20, 30, 40, 50 };
//	int* ptr = arr;
//
//	const int LEN = sizeof(arr) / sizeof(arr[0]);
//
//	for (int i = 0; i < LEN; i++)
//	{
//
//		printf("arr[%d]의 값: %d, 주소: %p, &arr[i]: %p\n", i, *(ptr + i), ptr + i, &arr[i]);
//	}
//}

// -------------------------------------------------------------------------
// 06. int형 배열을 선언하고,
//     포인터를 이용해 배열 원소들의 합을 구하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	int arr[5] = { 10, 20, 30, 40, 50 };
//	int* ptr = arr;
//
//	const int LEN = sizeof(arr) / sizeof(arr[0]);
//
//	int sum = 0;
//	for (int i = 0; i < LEN; i++)
//	{
//		sum += *(ptr + i);
//	}
//
//	printf("sum : %d", sum);
//
//	return 0;
//}

// -------------------------------------------------------------------------
//06. 포인터를 매개변수로 받는 함수를 작성하여,
//    함수 내부에서 변수 값을 변경하도록 구현하세요.
// -------------------------------------------------------------------------

//void change_x(int* ptr);
//
//int main(void)
//{
//	int x = 10;
//	int* ptr = &x;
//
//	printf("변경 전 x의 값 : %d\n", *ptr);
//	change_x(&x);
//	printf("변경 후 x의 값 : %d", *ptr);
//}
//
//void change_x(int* ptr)
//{
//	*ptr = 100;
//}

// -------------------------------------------------------------------------
// 07. 두 개의 int형 변수를 선언하고,
//     swap 함수를 포인터로 구현하여 값을 교환하세요.
// -------------------------------------------------------------------------
//void swap(int* ptr1, int* ptr2);
//
//int main(void)
//{
//	int a = 10, b = 20;
//	
//	printf("swap 전 a: %d, b: %d\n", a, b);
//	swap(&a, &b);
//	printf("swap 후 a: %d, b: %d", a, b);
//
//	return 0;
//}
//
//void swap(int* ptr1, int* ptr2)
//{
//	int temp = 0;
//	temp = *ptr1;
//	*ptr1 = *ptr2;
//	*ptr2 = temp;
//}

// -------------------------------------------------------------------------
// 08. 포인터를 이용하여
//     배열의 모든 원소를 1씩 증가시키는 함수를 작성하세요.
// -------------------------------------------------------------------------
//void plus(int* ptr, int LEN);
//
//int main(void)
//{
//	int arr[5] = { 10, 20, 30, 40, 50 };
//
//	const int LEN = sizeof(arr) / sizeof(arr[0]);
//
//
//	for (int i = 0; i < LEN; i++)
//	{
//		printf("원본 arr : %d\n", arr[i]);
//	}
//
//	plus(arr, LEN);
//
//	for (int i = 0; i < LEN; i++)
//	{
//		printf("변경 후  arr : %d\n", arr[i]);
//	}
//
//	return 0;
//}
//void plus(int* ptr, int LEN)
//{
//	for (int i = 0; i < LEN; i++)
//	{
//		*(ptr + i) += 1;
//	}
//}

// -------------------------------------------------------------------------
// 09. char 배열(문자열)을 선언하고,
//     포인터를 사용해 문자열을 한 글자씩 출력하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	char chr[] = "Hello";
//	char* ptr = chr;
//	
//	while (*ptr != '\0')
//	{
//		printf("%c\n", *ptr);
//		ptr++;
//	}
//}

// -------------------------------------------------------------------------
// 10. int형 변수, int 포인터, int 이중 포인터를 선언하고,
//     **pp를 이용해 변수 값을 변경하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	int a = 10;
//	int* p = &a;
//	int** pp = &p;
//
//	**pp = 100;
//
//	printf("a의 값 : %d", **pp);
//
//	return 0;
//}

// -------------------------------------------------------------------------
// 11. 2차원 int 배열을 선언하고,
//     행 포인터(int (*)[N])를 사용해 모든 원소를 출력하세요.
// -------------------------------------------------------------------------
//int main(void)
//{
//	int arr[2][3] = { {1, 2, 3 }, {4, 5, 6} };
//	int(*ptr)[3] = arr;
//	
//	for (int i = 0; i < 2; i++)
//	{
//		for (int j = 0; j < 3; j++) 
//		{
//			printf("%d", ptr[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}