/* *******************************************************************
* File name    : apple.h
* Description  : 사과 게임 헤더파일
* Author       : HyeonWoo
* History      : 2026.01.13 HyeonWoo
* ********************************************************************/
#ifndef APPLE_H
#define APPLE_H

// -------------------------------------------------------------------
// 헤더 파일
// -------------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <Windows.h>

// -------------------------------------------------------------------
// 매크로 상수
// -------------------------------------------------------------------
#define ROWS	  10
#define COLS	  10
#define GOAL	  10
#define HIT       100

// -------------------------------------------------------------------
// 구조체
// -------------------------------------------------------------------
struct apple {
	int origin;     // 사과의 원래 숫자
	int removed;    // 삭제 여부 (0: 존재, 1: 삭제됨)
};

struct state {
	int score;          // 현재 점수
	int total_removed;  // 총 제거된 사과 개수
};

// -------------------------------------------------------------------
// 함수 선언
// -------------------------------------------------------------------
void init_board();
void print_board();
void deleted(int r1, int c1, int r2, int c2);
int sum_selected(int r1, int c1, int r2, int c2);
int check_removed(int r1, int c1, int r2, int c2);

void apple_game();

#endif
