/* *******************************************************************
* File name    : ex02_define.c
* Description  : #define 전처리기
*				 - #연산자 -> 매개변수의 문자열 치환
*				 - ##연산자 -> 매개변수의 문자열 치환
* Author       : HyeonWoo
* History      : 2026.01.14
* ********************************************************************/
// -------------------------------------------------------------------
// 1. 전처리기 
// -------------------------------------------------------------------
#include <stdio.h>

// -------------------------------------------------------------------
// 2. 매크로 함수/상수 정의 
// -------------------------------------------------------------------
#define CURRENCY_KR "won"
#define CURRENCY_kr CURRENCY_KR		// 국가 코드(KR)가 대소문자 모두 가능하도록 추가
#define CURRENCY_US "dollar"
#define	CURRENCY_us CURRENCY_US

#define DATE_FORMAT_KR "YYYY/MM/DD"
#define DATE_FORMAT_US "MM/DD/YY"

#define call(fn, na)    get_## fn ## _ ## na ## ()
#define getCurrency(na) CURRENCY_ ## na

// -------------------------------------------------------------------
// 3. 구조체 정의 
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 4. 전역 변수/상수 선언 (Global Variable / constant)
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 5. 함수 선언 
// -------------------------------------------------------------------
void get_dateFormat_kr(void);
void get_dateFormat_us(void);

// -------------------------------------------------------------------
// 6. 메인 함수 
// -------------------------------------------------------------------
int main(void)
{
	call(dateFormat, kr);
	call(dateFormat, us);
	printf("currency of %s : %s\n", "KR", getCurrency(KR));	// CURRENCY_KR
	printf("currency of %s : %s\n", "us", getCurrency(us));	// CURRENCY_us

	return 0;
}
// -------------------------------------------------------------------
// 7. 함수 구현 
// -------------------------------------------------------------------
void get_dateFormat_kr(void)
{
	printf("get_dataFormat_kr() : %s\n", DATE_FORMAT_KR);
}
void get_dateFormat_us(void)
{
	printf("get_dataFormat_us() : %s\n", DATE_FORMAT_US);
}