/* *******************************************************************
* File name    : ex01_struct.c
* Description  : 구조체
* Author       : HyeonWoo
* History      : 2026.01.12 HyeonWoo
* ********************************************************************/
// -------------------------------------------------------------------
// 1. 전처리기 - 헤더파일 포함 
// -------------------------------------------------------------------
#include <stdio.h>
#include <string.h>

// -------------------------------------------------------------------
// 2. 매크로 상수 정의 
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 3. 구조체 정의 
// -------------------------------------------------------------------
// 학생 정보 타입
struct student {
	int no;
	char name[30];
	int kor, math, eng;
};


struct person {
	char  name[30];
	int   age;
	float height;
	float weight;
	char  blood;
	char  gender;
};

typedef struct person Person;
// -------------------------------------------------------------------
// 4. 전역 변수/상수 선언 (Global Variable / constant)
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 5. 함수 선언 
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 6. 메인 함수 
// -------------------------------------------------------------------
int main(void)
{

	// 구조체 변수 선언
	struct student std1 = { 1, "HyeonWoo1", 100, 80, 75 };
	struct student std2 = { 2, "HyeonWoo2", 90, 60, 75 };

	Person hyeon = { 0 };
	Person park = { "박찬호", 10, 180.4, 75.3, 'A', 'F' };

	char msg1[10] = "Good";		// -> 컴파일러가 요소 1개 1개 넣어줌
	char msg2[] = { 'H', 'E', 'L', 'L', 'O', '\0' };
	char msg3[10];

	//msg3 = "Happy"; error
	//msg3 = { 'H', 'E', 'L', 'L', 'O', '\0' }; error

	for (int i = 0; i < 10; i++)
	{
		msg3[0] = 'H';
	}

	// 속성 확인 : 구조체 변수명.속성명
	printf("학번 : %d, 이름 : %s, 국어 : %d, 수학 : %d, 영어 : %d\n", std1.no, std1.name, std1.kor, std1.math, std1.eng);
	printf("이름 : %s, 나이 : %d, 키 : %.1f, 몸무게 : %.1f, 혈액형 : %c, 성별 : %c\n",
		    park.name, park.age, park.height, park.weight, park.blood, park.gender);

	// 속성 변경 : 구조체 변수명.속성명 = 새로운 값;
	park.age = 11;
	park.blood = '0';
	//park.name = "박혁거세";	error
	strcpy(park.name, "박혁거세");

	printf("이름 : %s, 나이 : %d, 키 : %.1f, 몸무게 : %.1f, 혈액형 : %c, 성별 : %c\n",
		    park.name, park.age, park.height, park.weight, park.blood, park.gender);

	return 0;
}
// -------------------------------------------------------------------
// 7. 함수 구현 
// -------------------------------------------------------------------
