/* *******************************************************************
* File name    : ex07_struct.c
* Description  : 구조체와 함수
* Author       : HyeonWoo
* History      : 2026.01.12 HyeonWoo
* ********************************************************************/
// -------------------------------------------------------------------
// 1. 전처리기 - 헤더파일 포함 
// -------------------------------------------------------------------
#include <stdio.h>
#include <string.h>

// -------------------------------------------------------------------
// 2. 매크로 상수 정의 
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 3. 구조체 정의 
// -------------------------------------------------------------------
// 학생 타입
struct student {
	int no;
	int kor, eng, math;
};

// 타입 재정의
typedef struct student Student;
// -------------------------------------------------------------------
// 4. 전역 변수/상수 선언 (Global Variable / constant)
// -------------------------------------------------------------------

// -------------------------------------------------------------------
// 5. 함수 선언 
// -------------------------------------------------------------------
// 함수기능 : 구조체 속성 / 필드 출력 기능
// 함수이름 : printAttr
// 매개변수 : Student std
// 반환결과 : 없음
// -------------------------------------------------------------------
void printAttr(Student std)
{
	printf("%d, %d, %d, %d\n", std.no, std.kor, std.eng, std.math);
}
// -------------------------------------------------------------------
// 함수기능 : 구조체 속성 / 필드 출력 기능
// 함수이름 : printField
// 매개변수 : Student* ptr
// 반환결과 : 없음
// -------------------------------------------------------------------
void printField(const Student *const ptr)
{
	printf("%d, %d, %d, %d\n", ptr->no, ptr->kor, ptr->eng, ptr->math);
	//Student ss = { 0 };

	//ptr->math = 77;
	//ptr->kor = 92;
}
// -------------------------------------------------------------------
// 6. 메인 함수 
// -------------------------------------------------------------------
int main(void)
{
	// 변수 선언 및 초기화
	Student st1 = { 1, 100, 100, 100 };
	Student* pst = &st1;

	Student st2 = *pst;  // 값을 대입

	// call by value
	printAttr(st1);
	printf("[st1] %d, %d, %d, %d\n", 
		st1.no, st1.kor, st1.eng, st1.math);

	// call by reference
	printField(pst);  
	printf("[st1 after printField] %d, %d, %d, %d\n",
		st1.no, st1.kor, st1.eng, st1.math);

	// 3) st2는 처음에 복사된 값 그대로 유지
	printAttr(st2);
	printf("[st2 final] %d, %d, %d, %d\n",
		st2.no, st2.kor, st2.eng, st2.math);

	return 0;
}
// -------------------------------------------------------------------
// 7. 함수 구현 
// -------------------------------------------------------------------
